{
  "backend/main.mo": "Motoko canister implementing portfolio staking holdings with lock/unlock logic, time-based expiration, and role-based access control for users and admins.",
  "feature_evidence.json": "Feature evidence report mapping Android and iOS store release preparation and asset-pack features to documentation files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Aggregated human-written summaries describing frontend source files, styles, hooks, components, game features, and branding updates across the web app.",
  "frontend/docs/store-submission/android-google-play.md": "Step-by-step instructions for generating a signed Android App Bundle (AAB) and submitting it to Google Play Console, including prerequisites and keystore setup.",
  "frontend/docs/store-submission/ios-app-store.md": "Detailed guide for building an iOS release archive and submitting to App Store Connect, covering certificates, provisioning profiles, and bundle configuration.",
  "frontend/index.html": "Main HTML entry point defining SEO metadata, social sharing tags, structured data, multilingual hreflang links, and branding with the app store icon.",
  "frontend/public/robots.txt": "Robots.txt configuration allowing global search engine crawling with crawl-delay tuning, disallowed private paths, and sitemap reference.",
  "frontend/public/sitemap.xml": "XML sitemap listing the homepage and key site sections with priorities, last-modified dates, hreflang alternates, and associated app icon imagery.",
  "frontend/README-store-submission.md": "High-level quick-start guide outlining how to build and submit the X39 Matrix app to Google Play and Apple App Store.",
  "frontend/release/release-notes.en.md": "Release notes for X39 Matrix v1.0.0 detailing the initial launch, core DeFi features (portfolio, staking, governance, market data), ICP integration, design philosophy, and platform availability.",
  "frontend/release/versions/android-release-version.md": "Documents Android app versioning for the initial Google Play release (v1.0.0, code 1) and outlines version increment rules for future releases.",
  "frontend/release/versions/ios-release-version.md": "Defines iOS App Store versioning for the initial release (v1.0.0, build 1) and provides guidance for future build and marketing version increments.",
  "frontend/src/App.tsx": "Main React application entry that sets up React Query, language context, intro flow, navigation, and assembles all major landing, portfolio, and promotional sections.",
  "frontend/src/components/AndroidDownloadButton.tsx": "Reusable button component that links to the Android Play Store, falls back to direct APK download, or shows a disabled state based on distribution configuration.",
  "frontend/src/components/AndroidDownloadModal.tsx": "Modal dialog explaining Android/PWA installation with multilingual support, including step-by-step instructions and important usage notes.",
  "frontend/src/components/AndroidMobileAppSection.tsx": "Landing page section promoting the X39 Matrix Android app, highlighting features like token focus, airdrops, wallet integration, and download options.",
  "frontend/src/components/AudioControl.tsx": "Empty component file reserved for future audio control functionality.",
  "frontend/src/components/auth/X39LoginButton.tsx": "Login/logout button that integrates with Internet Identity, handles authentication state, loading feedback, and clears cached queries on logout.",
  "frontend/src/components/CharacterSelection.tsx": "Empty component file intended for a future character selection feature.",
  "frontend/src/components/ChopinVideoPlayer.tsx": "Full-screen video overlay component that plays a 45-second Chopin video with countdown timer and triggers a callback on completion.",
  "frontend/src/components/CinematicExperience.tsx": "Empty component file likely planned for a future cinematic or immersive user experience.",
  "frontend/src/components/Comecoco.tsx": "Implements a Pac-Man–style canvas game using React hooks, managing game state, input, movement, collisions, scoring, and rendering within a fixed maze.",
  "frontend/src/components/ConnectivityDiagnostics.tsx": "Renders a modal UI that runs and displays connectivity and backend health diagnostics, with environment details and the ability to copy a generated diagnostic report.",
  "frontend/src/components/CrossPlatformDistributionSection.tsx": "Displays a marketing section with cards for Android, iOS, and web access, linking to app store URLs or fallback APK downloads based on configuration.",
  "frontend/src/components/CrossPlatformPromotionalBanner.tsx": "Shows a highly styled promotional banner advertising the X39 Matrix token and official portal, including animated effects, links, and supported platform logos.",
  "frontend/src/components/DailyNewsUpdates.tsx": "Fetches and displays daily crypto/ICP-related news items with categories, timestamps, loading and error states, using mock data refreshed every 24 hours.",
  "frontend/src/components/DavosOracleForumBlock.tsx": "Empty component file with no implementation or exports.",
  "frontend/src/components/DavosOracleSection.tsx": "Empty component file with no implementation or exports.",
  "frontend/src/components/DavosOutcomesReportSection.tsx": "Renders a full-screen, highly stylized section presenting a Davos outcomes report with animated neon visuals, circuit imagery, and structured article content in Spanish.",
  "frontend/src/components/DualTokenPresentationSection.tsx": "File is empty or missing content; intended component implementation not provided.",
  "frontend/src/components/ElementChatSection.tsx": "Displays a call-to-action section with a styled button that opens a private Element (Matrix) chat link in a new tab.",
  "frontend/src/components/GameHUD.tsx": "File is empty or missing content; intended game HUD component not provided.",
  "frontend/src/components/GameWorld.tsx": "File is empty or missing content; intended game world component not provided.",
  "frontend/src/components/GolumanjiGame.tsx": "File is empty or missing content; intended game implementation not provided.",
  "frontend/src/components/governance/GovernanceModule.tsx": "Top-level governance UI that requires authentication, lists proposals, and conditionally shows proposal details based on user selection.",
  "frontend/src/components/governance/ProposalDetail.tsx": "Detailed view for a single governance proposal, showing description, vote breakdown, status, and allowing authenticated users to cast votes.",
  "frontend/src/components/governance/ProposalList.tsx": "Renders a list of governance proposals with status badges, vote counts, and loading/empty states, allowing selection of a proposal. Fetches data via useGetAllProposals and supports localized text and NNS styling.",
  "frontend/src/components/GraficosSection.tsx": "Implements an interactive market chart section that fetches ICP price data, calculates RSI, generates buy/sell signals, and shows projections across selectable time intervals.",
  "frontend/src/components/HolographicHero.tsx": "Creates a Three.js-powered holographic hero animation with a rotating glowing triangle and particle effects rendered to a full-screen canvas.",
  "frontend/src/components/ICPDarkWebDangersPopup.tsx": "Modal popup component showing translated warnings about dark web dangers, with keyboard handling, scroll locking, and animated neon styling.",
  "frontend/src/components/ICPNinjaIntegrationGuide.tsx": "File is empty or missing content; intended integration guide component not provided.",
  "frontend/src/components/ICPPaymentGate.tsx": "Renders a payment gate UI requiring a 1 ICP transfer, showing a wallet address with copy support and previewing locked premium content.",
  "frontend/src/components/ICPStakingButton.tsx": "Provides a styled button that opens the ICP NNS staking interface in a new tab, with localization and hover effects.",
  "frontend/src/components/ICPWalletButton.tsx": "Renders a styled button that opens the Internet Computer wallet dashboard in a new tab, with responsive labels and localization support.",
  "frontend/src/components/InformacionVariadaSection.tsx": "Displays an informational section with themed content, including a playable Chopin video background and explanatory blocks about ICP, APIs, and tools.",
  "frontend/src/components/IntroScreen.tsx": "Shows a full-screen animated intro with a canvas-based matrix effect and cyberpunk visuals, automatically completing after a short duration.",
  "frontend/src/components/LanguageContext.tsx": "Provides a React context for multilingual support, managing the current language and translation lookup across the application.",
  "frontend/src/components/LiveICPPrice.tsx": "Fetches and displays live ICP market data with periodic updates, animations on price changes, loading and error states, and localized messaging.",
  "frontend/src/components/MainMenu.tsx": "Empty component file reserved for the main navigation menu implementation.",
  "frontend/src/components/MatrixProtocolCurrentDevelopmentsSection.tsx": "Empty component file intended to present current developments of the Matrix Protocol.",
  "frontend/src/components/MatrixProtocolForumBlock.tsx": "Empty component file intended to embed or link to a Matrix Protocol discussion forum.",
  "frontend/src/components/MatrixProtocolMeetingSection.tsx": "Empty component file intended to display meeting or event information related to the Matrix Protocol.",
  "frontend/src/components/MissionBriefing.tsx": "Empty component file intended to present a mission briefing or introductory narrative section.",
  "frontend/src/components/PerformanceMetricsDashboard.tsx": "Renders a cyberpunk-styled dashboard showing mock performance metrics for multiple platforms, refreshing automatically every 30 seconds.",
  "frontend/src/components/portfolio/NnsBlueTheme.ts": "Defines NNS-inspired color constants, Tailwind CSS class presets, and spacing tokens for consistent blue-themed UI styling across the portfolio.",
  "frontend/src/components/portfolio/PortfolioHeader.tsx": "Displays the portfolio header with title, subtitle, wallet icon, and login button using localized text and a blue gradient background.",
  "frontend/src/components/portfolio/PortfolioNav.tsx": "Provides tab navigation between staking and governance views, highlighting the active tab and emitting tab change events.",
  "frontend/src/components/portfolio/X39PortfolioShell.tsx": "Main portfolio container that composes header, navigation, and content, manages active tab state, and syncs tab selection with URL hash deep links.",
  "frontend/src/components/PremiumButton.tsx": "Displays a premium access button with tooltip and localization that smoothly scrolls the user to the premium ICP section.",
  "frontend/src/components/PremiumICPSections.tsx": "Defines a reusable PremiumSection layout with animated visuals and exports ICP-focused premium content sections (AvanceExclusivoICPSection, InformacionEstrategicaICPSection) containing highly stylized, marketing-driven blockchain messaging.",
  "frontend/src/components/QRCodeSection.tsx": "Renders a floating QR code widget that dynamically loads the qrcodejs library from multiple CDNs with retries, generates a QR code for a given URL, and handles loading/error states.",
  "frontend/src/components/RedditPromoSection.tsx": "Displays a Reddit-formatted promotional message with Matrix-themed styling and ICP/X39 Matrix updates, using a language context for localization.",
  "frontend/src/components/SourceCodeDisplay.tsx": "Shows a list of source files with paths and contents in a styled code viewer and provides a one-click copy-to-clipboard feature for all displayed code.",
  "frontend/src/components/stake/CreateHoldingForm.tsx": "Form for creating a new staking holding by entering amount and lock duration, handling validation, submission, and loading states.",
  "frontend/src/components/stake/HoldingsList.tsx": "Lists user staking holdings with status badges, dates, and actions to unlock or delete holdings, including loading and empty states.",
  "frontend/src/components/stake/StakeHoldModule.tsx": "Staking module that gates access by login status and renders the create holding form and holdings list for authenticated users.",
  "frontend/src/components/TokenAnalyticsPanel.tsx": "Presents a stylized analytics dashboard with mock Binance/ICP token metrics such as volume, value, inflow, and outflow using iconography and animations.",
  "frontend/src/components/TrochoDriveElement.tsx": "Renders a central animated X39 Matrix logo element with layered mist, glow, and pulse effects, serving as a visually prominent branding component.",
  "frontend/src/components/WalletRegistrationModal.tsx": "Modal component that lets users select a wallet type and enter an address, performs basic client-side validation, and simulates wallet registration with loading and success states.",
  "frontend/src/components/X39ICPGame.tsx": "Implements a 3D browser game using react-three-fiber where an ICP player collects items and interacts with enemy crypto-themed entities, managing game state, collisions, and rendering.",
  "frontend/src/components/X39TokenAnnouncementBlock.tsx": "File is currently empty and does not define any components or logic.",
  "frontend/src/components/X39TokenLaunchScheduleSection.tsx": "File is currently empty and does not define any components or logic.",
  "frontend/src/components/X39TokenPromotionalAirdropSection.tsx": "Promotional section UI for a limited X39 token airdrop, displaying marketing content and opening the WalletRegistrationModal to claim tokens with mock success handling.",
  "frontend/src/components/X39TokenRegistrationSection.tsx": "Displays static informational content about the X39 Matrix token, including supply details and its contribution to the ICP ecosystem, styled as a full-page section.",
  "frontend/src/config/distribution.ts": "Central configuration for app distribution URLs across Android, iOS, and web, with helpers to detect availability and fallback behavior.",
  "frontend/src/hooks/governance/useProposals.ts": "React Query hooks for fetching proposals, fetching a single proposal, and voting on proposals via a backend actor with cache invalidation.",
  "frontend/src/hooks/holdings/useHoldings.ts": "Provides React Query hooks to fetch, create, unlock, and delete user holdings via the backend actor, with automatic cache invalidation.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the current Internet Identity using React Query, recreating and invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useConnectivityDiagnostics.ts": "Implements a diagnostics hook that runs connectivity checks (domain, HTTPS, asset access, backend health) and tracks their status and results.",
  "frontend/src/hooks/useInternetIdentity.ts": "Defines an Internet Identity context and provider handling authentication lifecycle, login/logout, identity persistence, and status flags using DFINITY AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Exposes React Query hooks for fetching the caller’s user profile and backend health status through the backend actor.",
  "frontend/src/index.css": "Global Tailwind CSS setup with theme tokens, dark mode variables, custom fonts, and cyberpunk-style visual effects and animations.",
  "frontend/src/main.tsx": "Application entry point that renders the app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/services/icpMarketData.ts": "Service for fetching ICP price and candlestick data from Binance with timeout handling and automatic fallback to a backend proxy via the actor.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters from query strings or hash-based routes, persist them in sessionStorage, and retrieve or clear them with URL values taking precedence. Includes logic to safely store sensitive parameters across navigation and clean them from the URL.",
  "frontend/src/utils/urls.ts": "Defines domain-safe URL utilities, including current origin detection, absolute URL building, HTTPS checks, hostname extraction, and canonical asset URLs tied to the official x39matrix.com domain. Also includes smooth scrolling to page sections.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration enabling class-based dark mode, custom OKLCH color tokens, extended border radii, and multiple font families to support the cyberpunk/matrix theme. Registers animation and typography plugins and scans frontend source files for classes.",
  "project_state.json": "High-level project state and scope definition describing the rebrand to x39matrix.com and a growing feature set spanning marketing, theming, SEO, visuals, live crypto data, and future staking/governance plans. Tracks schema versioning and a catalog of implemented features with IDs and descriptions."
}