{
  "backend/main.mo": "Motoko actor managing publication state, access-controlled admin queries, and a holdings system with create, view, filter, and unlock logic.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to related frontend files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Collection of short summaries describing functionality and styling of various frontend components, hooks, and config files.",
  "frontend/docs/release/domain-strategy-and-hardening.en.md": "Documentation explaining canonical and satellite domain strategy, redirect behavior, and DNS/SSL configuration.",
  "frontend/docs/release/global-availability-readiness-checklist.md": "Checklist for verifying DNS, custom domain mapping, and global availability before launch.",
  "frontend/docs/release/go-live-runbook-2026-03-15.en.md": "Operational runbook detailing pre-launch checks, launch-day DNS cutover, publication activation, and rollback steps for March 15, 2026.",
  "frontend/docs/release/launch-verification-checklist.en.md": "Post-cutover checklist for verifying domain, HTTPS, DNS propagation, redirects, and site functionality after the March 15, 2026 launch.",
  "frontend/docs/release/seo-homepage-metadata-update.en.md": "Describes updates to Spanish hero copy and SEO metadata, including titles, descriptions, and structured data.",
  "frontend/docs/store-submission/android-google-play.md": "Step-by-step guide for preparing, building, signing, and submitting the Android app to Google Play.",
  "frontend/docs/store-submission/ios-app-store.md": "Instructions for configuring Apple developer assets and building/submitting the iOS app to App Store Connect.",
  "frontend/docs/store-submission/release-handoff.en.md": "Central index linking all launch, submission, and asset documents for operators handling the March 15, 2026 release.",
  "frontend/docs/store-submission/store-listing-assets.md": "Maps all pre-generated store listing assets to their required upload locations for Google Play and App Store.",
  "frontend/docs/store-submission/store-listing-copy/google-play.en.md": "Official Google Play listing text including app name, descriptions, what's new, keywords, and category.",
  "frontend/docs/store-submission/store-listing-copy/ios-app-store.en.md": "Official App Store listing copy including subtitle, promotional text, description, keywords, and release notes.",
  "frontend/index.html": "Main HTML entry with comprehensive SEO, social meta tags, and structured data for the X39 Matrix website.",
  "frontend/public/robots.txt": "Robots.txt specifying crawl rules, delays, disallowed paths, and sitemap location for search engines.",
  "frontend/public/sitemap.xml": "XML sitemap listing key site URLs, priorities, update frequencies, multilingual alternates, and image metadata.",
  "frontend/README-store-submission.md": "Guide outlining steps for building and submitting the app to Google Play and Apple App Store.",
  "frontend/release/release-notes.en.md": "Release notes detailing features, design, integrations, and instructions for version 1.0.0 of X39 Matrix.",
  "frontend/release/release-status-tracker.md": "Tracks release milestones, store review statuses, metrics, and known issues for web, Android, and iOS.",
  "frontend/release/store-submission-checklist.md": "Checklist covering global readiness, build steps, assets, and store submission requirements for Android and iOS.",
  "frontend/release/versions/android-release-version.md": "Documents Android version numbers, release notes reference, and version history for the initial 1.0.0 release.",
  "frontend/release/versions/ios-release-version.md": "Documents iOS marketing version, build number, history, and update rules for the initial 1.0.0 release.",
  "frontend/scripts/release/build-android-aab.sh": "Shell script that validates keystore setup and builds a signed Android App Bundle for release.",
  "frontend/scripts/release/build-ios-archive.sh": "Builds a signed iOS release archive using Xcode, verifies environment, cleans previous builds, and outputs the .xcarchive for App Store distribution.",
  "frontend/src/App.tsx": "Main React app component initializing providers, intro flow, background audio, navigation, language, and multiple homepage sections.",
  "frontend/src/components/admin/AdminGoLiveToggle.tsx": "Provides an admin-only toggle to switch the site between pre-launch and live states, showing status, errors, and success messages. Uses authentication and publication state hooks.",
  "frontend/src/components/AndroidDownloadButton.tsx": "Renders an Android download button that links to Play Store, APK fallback, or a disabled state depending on configuration.",
  "frontend/src/components/AndroidDownloadModal.tsx": "Displays a modal with PWA-based Android installation instructions and multilingual content.",
  "frontend/src/components/AndroidMobileAppSection.tsx": "Promotional section describing the Android app with visuals and feature highlights, linking to Play Store or APK when available.",
  "frontend/src/components/AudioControl.tsx": "Audio control widget providing play/pause, mute, and status display for background audio.",
  "frontend/src/components/auth/X39LoginButton.tsx": "Displays a login/logout button using Internet Identity with loading states and error handling. Toggles authentication and clears cached queries when logging out.",
  "frontend/src/components/CharacterSelection.tsx": "Empty or placeholder component with no implementation.",
  "frontend/src/components/ChopinVideoPlayer.tsx": "Plays a 45‑second Chopin video with a countdown timer and calls onComplete when finished.",
  "frontend/src/components/CinematicExperience.tsx": "Empty file with no implemented content.",
  "frontend/src/components/Comecoco.tsx": "Implements a Pac‑Man‑style canvas game with movement, ghosts, maze layout, scoring, and game states.",
  "frontend/src/components/ConnectivityDiagnostics.tsx": "Runs and displays connectivity diagnostics with tabs, status icons, and copyable reports.",
  "frontend/src/components/ConnectivityStatusBanner.tsx": "Shows a dismissible top banner when connectivity checks fail, linking to diagnostics.",
  "frontend/src/components/CopyableValue.tsx": "Displays a text value with a button to copy it to the clipboard and feedback on success.",
  "frontend/src/components/CrossPlatformDistributionSection.tsx": "Renders platform download options for Android, iOS, and web with fallback APK support.",
  "frontend/src/components/CrossPlatformPromotionalBanner.tsx": "Displays a stylized promotional banner highlighting the X39 Matrix token and official portal.",
  "frontend/src/components/DailyNewsUpdates.tsx": "Fetches and displays pinned and mock news items with loading, error handling, and a modal for selected news.",
  "frontend/src/components/DavosOracleForumBlock.tsx": "Empty placeholder component.",
  "frontend/src/components/DavosOracleSection.tsx": "Empty placeholder component.",
  "frontend/src/components/DavosOutcomesReportSection.tsx": "Renders a stylized Davos outcomes report section with decorative visuals and structured analysis content.",
  "frontend/src/components/DomainDnsVerificationView.tsx": "Displays DNS and domain verification status, generates a detailed cutover report, and supports copying diagnostics.",
  "frontend/src/components/DualTokenPresentationSection.tsx": "Empty placeholder component.",
  "frontend/src/components/ElementChatSection.tsx": "Provides a button linking to the Matrix Element chat with styled UI and a brief description.",
  "frontend/src/components/ErrorBoundary.tsx": "Catches rendering errors and displays a recovery UI with reset and reload options.",
  "frontend/src/components/GameHUD.tsx": "Empty placeholder component.",
  "frontend/src/components/GameWorld.tsx": "Empty placeholder component.",
  "frontend/src/components/GolumanjiGame.tsx": "Empty placeholder component.",
  "frontend/src/components/governance/GovernanceModule.tsx": "Main governance wrapper that requires login and switches between proposal list and selected proposal detail views. Handles proposal selection state.",
  "frontend/src/components/governance/ProposalDetail.tsx": "Shows full details of a selected proposal, including vote breakdown and interactive voting if open. Handles vote submission, loading states, and back navigation.",
  "frontend/src/components/governance/ProposalList.tsx": "Lists all proposals with status badges, brief descriptions, and vote counts. Allows selecting a proposal to view details.",
  "frontend/src/components/GraficosSection.tsx": "Loads and displays ICP market chart data, computes RSI and trading signals, and handles errors and loading states.",
  "frontend/src/components/header/HeaderTriangleCodeRain.tsx": "Creates an animated canvas effect of falling glowing triangles with performance-aware rendering. Manages particles, resizing, and animation lifecycle.",
  "frontend/src/components/HolographicHero.tsx": "Sets up a Three.js holographic background with a rotating triangle, outline, particles, and animation loop, handling WebGL support and errors.",
  "frontend/src/components/ICPDarkWebDangersPopup.tsx": "Displays a modal popup warning about Dark Web dangers with localized text, escape‑key handling, and scroll locking.",
  "frontend/src/components/ICPNinjaIntegrationGuide.tsx": "Empty placeholder component file.",
  "frontend/src/components/ICPPaymentGate.tsx": "Renders a gated payment screen requiring a 1 ICP transfer, showing receiver info, previews, and Internet Identity hints.",
  "frontend/src/components/ICPStakingButton.tsx": "Button that opens the NNS staking site in a new tab with localized labels and hover effects.",
  "frontend/src/components/ICPWalletButton.tsx": "Button linking to a specific ICP wallet dashboard page with localized text and styling.",
  "frontend/src/components/InformacionVariadaSection.tsx": "Section with mixed ICP-related information, a playable Chopin video feature, and explanations of APIs and x39 CLI.",
  "frontend/src/components/IntroScreen.tsx": "Full‑screen intro animation that fades out after two seconds, showing a holographic triangle and title before completing.",
  "frontend/src/components/LanguageContext.tsx": "Provides a React context for language selection and string translation, including translation dictionaries for multiple languages.",
  "frontend/src/components/LaunchDryRun.tsx": "Runs connectivity and domain checks for a launch dry‑run, displaying pass/fail results and diagnostics with copyable reports.",
  "frontend/src/components/legal/LegalDisclaimerSection.tsx": "Renders a legal disclaimer section that switches between loading, pre-launch, and published states based on publication status.",
  "frontend/src/components/LiveICPPrice.tsx": "Fetches and displays live ICP price data with periodic updates, animations on change, and error handling.",
  "frontend/src/components/MainMenu.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/components/March15LaunchInfoSection.tsx": "Shows March 15, 2026 launch information when the publication state is live, with a button to open the launch dry‑run.",
  "frontend/src/components/MatrixProtocolCurrentDevelopmentsSection.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/components/MatrixProtocolForumBlock.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/components/MatrixProtocolMeetingSection.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/components/MissionBriefing.tsx": "Empty placeholder file with no implementation.",
  "frontend/src/components/OfficialWebsiteLinkCard.tsx": "Displays the official site URL with copy and open actions, and shows the current origin for diagnostics.",
  "frontend/src/components/PerformanceMetricsDashboard.tsx": "Generates and displays mock performance metrics for various platforms, refreshing automatically and manually.",
  "frontend/src/components/portfolio/NnsBlueTheme.ts": "Defines NNS-inspired blue theme color tokens, CSS class presets, and spacing constants for portfolio UI styling.",
  "frontend/src/components/portfolio/PortfolioHeader.tsx": "Displays the portfolio header with title, subtitle, wallet icon, and login button using localized text.",
  "frontend/src/components/portfolio/PortfolioNav.tsx": "Provides navigation buttons for switching between stake and governance tabs with active-state styling.",
  "frontend/src/components/portfolio/X39PortfolioShell.tsx": "Wraps the portfolio interface, manages tab state with URL hash syncing, and renders stake or governance modules.",
  "frontend/src/components/PremiumButton.tsx": "Renders a premium‑access button with tooltip and smooth scrolling to the premium section.",
  "frontend/src/components/PremiumICPSections.tsx": "Provides styled premium ICP sections with animated visuals and two exported section components for content display.",
  "frontend/src/components/QRCodeSection.tsx": "Loads a QR code script from multiple CDNs with retry logic and renders a dynamic QR code widget.",
  "frontend/src/components/RedditPromoSection.tsx": "Renders a Reddit‑formatted promotional message with ICP updates and X39 Matrix launch details.",
  "frontend/src/components/SourceCodeDisplay.tsx": "Displays multiple source files with copy‑to‑clipboard functionality and styled code sections.",
  "frontend/src/components/stake/CreateHoldingForm.tsx": "Form component allowing users to create a new holding by entering amount and duration, with validation and mutation handling.",
  "frontend/src/components/stake/HoldingsList.tsx": "Fetches and displays user holdings with status badges, timestamps, and unlock/delete actions.",
  "frontend/src/components/stake/StakeHoldModule.tsx": "Combines holding creation and listing components, showing a login-required prompt if the user is not authenticated.",
  "frontend/src/components/TokenAnalyticsPanel.tsx": "Shows mock token analytics metrics with formatted values and visual indicators for volume and flows.",
  "frontend/src/components/TrochoDriveElement.tsx": "Displays the X39 Matrix logo with layered animated mist effects and a styled title label.",
  "frontend/src/components/WalletRegistrationModal.tsx": "Modal for selecting a wallet type, validating an address, and simulating registration with success handling.",
  "frontend/src/components/X39HorseX39RainBackdrop.tsx": "Canvas-based backdrop rendering animated X and 39 characters in a rain effect with resize and reduced-motion handling.",
  "frontend/src/components/X39ICPGame.tsx": "Three.js/Fiber game components including player, enemies, collectibles, and scene logic with animation and state handling.",
  "frontend/src/components/X39MatrixLaunchAmbientEffects.tsx": "Full-screen canvas effect rendering animated Matrix‑style particles with color cycling and reduced‑motion support.",
  "frontend/src/components/X39MatrixLaunchHeroBlock.tsx": "Hero section for the launch page with animated backgrounds, countdown hook, themed copy, and smooth‑scroll CTA.",
  "frontend/src/components/X39TokenAnnouncementBlock.tsx": "Empty placeholder component file.",
  "frontend/src/components/X39TokenLaunchScheduleSection.tsx": "Empty placeholder component file.",
  "frontend/src/components/X39TokenPromotionalAirdropSection.tsx": "Airdrop promotion section with visual effects, token info, and wallet registration modal for claiming tokens.",
  "frontend/src/components/X39TokenRegistrationSection.tsx": "Renders a detailed token information section with mock X39 token data, animations, and design elements. Focuses on layout, visuals, and ecosystem contribution highlights.",
  "frontend/src/config/distribution.ts": "Centralizes Android, iOS, and web distribution URLs with helper functions for configuration checks.",
  "frontend/src/config/launchDate.ts": "Defines the mainnet launch date and provides helpers to check launch status and return a formatted date string.",
  "frontend/src/config/launchPayment.ts": "Stores the launch-time ICP payment receiver principal and provides utility accessors and labels for display and QR use.",
  "frontend/src/content/homeHeroCopy.ts": "Contains static homepage hero text including title, subtitle, and supporting copy.",
  "frontend/src/content/legalDisclaimer.en.md": "Markdown legal disclaimer outlining risks, no advice, liability limits, user responsibilities, and ICP notes.",
  "frontend/src/hooks/governance/useProposals.ts": "React-query hooks for fetching proposals, fetching a single proposal, and submitting votes with cache invalidation.",
  "frontend/src/hooks/holdings/useHoldings.ts": "Hooks to fetch, create, unlock, and delete user token holdings, refreshing related queries on updates.",
  "frontend/src/hooks/publication/usePublicationState.ts": "Hooks to read publication state, check admin status, and update publication visibility with query invalidation.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor tied to Internet Identity, recreating and refreshing dependent queries on identity change.",
  "frontend/src/hooks/useBackgroundAudio.ts": "Manages a 45‑second background audio clip including load state, playback, mute persistence, timers, and autoplay logic.",
  "frontend/src/hooks/useConnectivityDiagnostics.ts": "Runs frontend diagnostics checking domain, HTTPS, and backend health, producing structured status checks.",
  "frontend/src/hooks/useDomainRedirect.ts": "Redirects clients from satellite or www domains to the canonical portal while preserving URL components.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication using AuthClient, including login, logout, and status tracking.",
  "frontend/src/hooks/useLaunchCountdown.ts": "Implements a countdown hook that calculates time remaining until a fixed launch date and updates every second.",
  "frontend/src/hooks/useQueries.ts": "Defines react-query hooks to fetch the caller's user profile, backend health, and a receiver principal via an actor.",
  "frontend/src/index.css": "Configures Tailwind, custom OKLCH color variables, dark mode, fonts, neon effects, animations, and responsive text utilities.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider before rendering App.",
  "frontend/src/services/icpMarketData.ts": "Fetches ICP price and kline data from Binance with timeout handling and fallback to a backend proxy, including data validation and normalization.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL and session parameters, supporting both query and hash routing.",
  "frontend/src/utils/urls.ts": "Provides domain-safe URL utilities including canonical domain checks, hostname extraction, building URLs, and satellite domain detection.",
  "frontend/tailwind.config.js": "Configures Tailwind for the frontend, defining content paths, custom fonts, HSL-based theme colors, animations, and plugins including typography and container queries.",
  "project_state.json": "Tracks project metadata, architectural notes, and known issues, documenting the current app state, tech stack, token portal features, and deployment/domain blockers."
}