{
  "backend/main.mo": "Motoko canister implementing access control, user profiles, product management, blob storage mixin, and Stripe configuration with admin-only safeguards. Exposes authentication, authorization, product CRUD, and Stripe setup/query endpoints.",
  "feature_evidence.json": "Machine-readable report mapping implemented features to frontend files, dependencies, and test requirements. Documents high-confidence evidence for connectivity diagnostics and backend health features.",
  "frontend-file-summaries.txt": "Aggregated human-written summaries of all frontend source files describing UI components, styling, diagnostics hooks, and game features. Serves as documentation rather than executable code.",
  "frontend/index.html": "HTML entry point defining SEO, social sharing metadata, structured data, canonical URLs, and multilingual hreflang tags for x39matrix.com. Optimized for discoverability and consistent branding.",
  "frontend/public/robots.txt": "Robots.txt configuration allowing major search engines to crawl public assets while restricting admin, private, API, and JSON paths. Includes crawl-delay tuning and sitemap reference.",
  "frontend/public/sitemap.xml": "XML sitemap listing the homepage and key anchored sections with priorities, update frequency, hreflang alternates, and associated images. Supports international SEO and search engine indexing.",
  "frontend/src/App.tsx": "Main React application component orchestrating intro flow, language selection, navigation, holographic background, and all primary content sections. Adds a connectivity diagnostics view accessible via footer or URL parameter.",
  "frontend/src/components/AndroidDownloadButton.tsx": "Renders a styled Android download button that links to a domain-safe APK URL, with different layouts for header and footer variants and localized text.",
  "frontend/src/components/AndroidDownloadModal.tsx": "Displays a full-screen modal with localized instructions and notices for installing the Android/PWA app, including close controls and step-by-step guidance.",
  "frontend/src/components/AndroidMobileAppSection.tsx": "Provides a promotional section for the Android mobile app with branding, feature highlights, icons, and an APK download URL built from the current origin.",
  "frontend/src/components/AudioControl.tsx": "This file is empty and currently contains no implementation.",
  "frontend/src/components/CharacterSelection.tsx": "This file is empty and currently contains no implementation.",
  "frontend/src/components/ChopinVideoPlayer.tsx": "Plays a full-screen background video for a fixed 45-second cinematic sequence with a countdown timer and invokes a callback when playback completes.",
  "frontend/src/components/CinematicExperience.tsx": "This file is empty and currently contains no implementation.",
  "frontend/src/components/Comecoco.tsx": "Implements a Pac-Man–style canvas game with game states, keyboard controls, scoring, lives, ghost AI, and maze logic managed via React hooks.",
  "frontend/src/components/ConnectivityDiagnostics.tsx": "Renders a diagnostics overlay that runs and displays connectivity, domain, and backend health checks, with reporting, copy-to-clipboard, and refresh capabilities.",
  "frontend/src/components/CrossPlatformPromotionalBanner.tsx": "Renders a large animated promotional banner advertising the X39 Matrix token, highlighting the official portal URL and supported exchange platforms with heavy neon/red visual effects.",
  "frontend/src/components/DailyNewsUpdates.tsx": "Displays a daily-updating news feed with categorized crypto/ICP news, using mocked data, loading/error states, and relative time formatting.",
  "frontend/src/components/DavosOracleForumBlock.tsx": "Empty file placeholder with no implementation or exports.",
  "frontend/src/components/DavosOracleSection.tsx": "Empty file placeholder with no implementation or exports.",
  "frontend/src/components/DavosOutcomesReportSection.tsx": "Presents a full-page, stylized report section analyzing outcomes of the Davos forum with structured content, headers, and animated visual effects.",
  "frontend/src/components/DualTokenPresentationSection.tsx": "Empty file placeholder with no implementation or exports.",
  "frontend/src/components/ElementChatSection.tsx": "Provides a call-to-action section with a button that opens a private Element/Matrix chat room in a new tab, styled with red neon effects.",
  "frontend/src/components/GameHUD.tsx": "Empty file placeholder with no implementation or exports.",
  "frontend/src/components/GameWorld.tsx": "Empty file placeholder with no implementation or exports.",
  "frontend/src/components/GolumanjiGame.tsx": "Empty file placeholder with no implementation or exports.",
  "frontend/src/components/GraficosSection.tsx": "Implements an interactive ICP market chart section that fetches kline data, calculates RSI, generates buy/sell signals, and shows projections across selectable time intervals.",
  "frontend/src/components/HolographicHero.tsx": "Creates a Three.js-powered holographic hero animation with a rotating glowing triangle and animated particle field rendered on a full-screen canvas.",
  "frontend/src/components/ICPDarkWebDangersPopup.tsx": "Modal popup component that displays a translated list of Dark Web dangers with warnings, styled visuals, and accessibility features. It locks body scroll, closes on backdrop click or Escape key, and uses LanguageContext for i18n.",
  "frontend/src/components/ICPNinjaIntegrationGuide.tsx": "File exists but contains no implementation or exports, acting as an empty placeholder for a future ICP Ninja integration guide component.",
  "frontend/src/components/ICPPaymentGate.tsx": "Paywall-style component that gates premium content behind a 1 ICP payment, showing a wallet address with copy-to-clipboard functionality. Uses LanguageContext and Internet Identity state, but does not verify payment on-chain.",
  "frontend/src/components/ICPStakingButton.tsx": "Button component that opens the ICP Network Nervous System (NNS) staking page in a new tab. Uses translations for labels and applies animated neon-styled UI effects.",
  "frontend/src/components/ICPWalletButton.tsx": "Button that links to a specific ICP wallet dashboard in a new tab. Supports responsive labels and multilingual text via LanguageContext.",
  "frontend/src/components/InformacionVariadaSection.tsx": "Content section presenting miscellaneous ICP-related information, including a playable background music video and educational text about APIs and x39 CLI. Manages local state to control video playback.",
  "frontend/src/components/IntroScreen.tsx": "Animated intro screen with a canvas-based cyberpunk matrix effect and background image that auto-completes after two seconds. Calls a callback when finished and handles window resizing and animation cleanup.",
  "frontend/src/components/LanguageContext.tsx": "Global React context providing language selection and translation lookup for multiple locales (es, en, de, zh, ja). Stores structured translation dictionaries and exposes a `t` helper for nested keys.",
  "frontend/src/components/LiveICPPrice.tsx": "React component that fetches and displays live ICP price, 24h change, and market data with animations, loading/error states, and 30-second polling via an ICP actor service.",
  "frontend/src/components/MainMenu.tsx": "File present but content is empty or not provided, likely intended for the main navigation menu component.",
  "frontend/src/components/MatrixProtocolCurrentDevelopmentsSection.tsx": "File present but content is empty or not provided, presumably meant to show current developments of the Matrix Protocol.",
  "frontend/src/components/MatrixProtocolForumBlock.tsx": "File present but content is empty or not provided, likely reserved for a forum or discussion block component.",
  "frontend/src/components/MatrixProtocolMeetingSection.tsx": "File present but content is empty or not provided, intended to display Matrix Protocol meeting information.",
  "frontend/src/components/MissionBriefing.tsx": "File present but content is empty or not provided, likely designed for a mission briefing or introduction section.",
  "frontend/src/components/PerformanceMetricsDashboard.tsx": "Dashboard component that generates and displays mock performance metrics per platform, auto-refreshing every 30 seconds with cyberpunk-themed visuals.",
  "frontend/src/components/PremiumButton.tsx": "Premium CTA button that scrolls to the ICP premium section and shows a localized tooltip on hover.",
  "frontend/src/components/PremiumICPSections.tsx": "Defines premium ICP content sections with heavy branding and animated visuals, exporting multiple premium informational sections.",
  "frontend/src/components/QRCodeSection.tsx": "Utility component that dynamically loads a QR code library from multiple CDNs, generates a QR code for a given URL, and handles retries and error states.",
  "frontend/src/components/RedditPromoSection.tsx": "Styled section rendering a preformatted, Matrix-themed promotional message for Reddit with ICP and X39 Matrix updates.",
  "frontend/src/components/SourceCodeDisplay.tsx": "Renders a styled panel that displays multiple source files with headers and allows copying all code to the clipboard, showing temporary copy confirmation state.",
  "frontend/src/components/TokenAnalyticsPanel.tsx": "Displays a mock token analytics dashboard with trading volume, total value, and money inflow/outflow using static data and animated metric cards.",
  "frontend/src/components/TrochoDriveElement.tsx": "Shows a central animated X39 Matrix logo with layered mist, glow effects, and a stylized title beneath for branding emphasis.",
  "frontend/src/components/WalletRegistrationModal.tsx": "Implements a modal for registering a crypto wallet with validation, simulated submission, success feedback, and multiple wallet type options.",
  "frontend/src/components/X39ICPGame.tsx": "Defines a 3D browser game using react-three-fiber featuring an ICP player, enemies, collectibles, keyboard controls, and game state management.",
  "frontend/src/components/X39TokenAnnouncementBlock.tsx": "File exists but contains no implementation or content.",
  "frontend/src/components/X39TokenLaunchScheduleSection.tsx": "File exists but contains no implementation or content.",
  "frontend/src/components/X39TokenPromotionalAirdropSection.tsx": "Renders a promotional airdrop section for X39 tokens with animated visuals, claim flow, and integration with the wallet registration modal.",
  "frontend/src/components/X39TokenRegistrationSection.tsx": "React component that renders a full-screen, highly styled informational section describing the X39 Matrix token, its branding, and its contributions to the ICP ecosystem using mock token data.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that creates and manages an authenticated or anonymous ICP backend actor using React Query, recreating it when the Internet Identity changes and invalidating dependent queries.",
  "frontend/src/hooks/useConnectivityDiagnostics.ts": "Hook that runs a series of frontend and backend connectivity diagnostics, including domain, HTTPS, asset reachability, and backend health checks, and returns structured diagnostic results.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hooks for managing Internet Identity authentication, including login, logout, persisted identities, and detailed login status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching the caller’s user profile and backend health information from the ICP backend actor.",
  "frontend/src/index.css": "Global Tailwind CSS setup with custom design tokens, dark mode variables, cyberpunk fonts, neon effects, and custom animations used across the frontend.",
  "frontend/src/main.tsx": "Application entry point that initializes React, wraps the app with React Query and Internet Identity providers, and mounts it to the DOM.",
  "frontend/src/services/icpMarketData.ts": "Service module that fetches live ICP price and candlestick data from the Binance API with timeouts and automatic fallback to backend proxy methods.",
  "frontend/src/utils/urlParams.ts": "Provides utilities to read URL parameters from query strings or hash-based routing, persist them in sessionStorage, and retrieve or clear them across navigation. Includes helpers to prioritize URL values, safely store/retrieve session values, and remove sensitive parameters from the URL hash without reloading.",
  "frontend/src/utils/urls.ts": "Contains domain-safe URL helpers for building absolute URLs, detecting the current origin and HTTPS context, and working consistently across custom domains. Also includes utilities for scrolling to sections, extracting hostnames, and generating canonical asset URLs for the official portal.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode, content paths, plugins, and an extended theme with OKLCH-based color variables, custom fonts, border radii, and sidebar/chart color palettes. Supports the project’s cyberpunk design system and animations.",
  "project_state.json": "Stores structured metadata about the project’s scope, current state, and feature inventory, including versioning, high-level summary, and a catalog of implemented features with descriptions. Used to track evolving requirements and priorities for the x39Matrix token marketing portal."
}