{
  "kind": "build_request",
  "title": "Change X39 Matrix launch section green accents to celestial sky blue",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-16",
      "text": "Update the X39 Matrix launch hero block so that all green-colored accents are replaced with a celestial sky blue color, while keeping the existing red accents unchanged. This includes (but is not limited to) Tailwind classes like `text-green-*`, `border-green-*`, `from-green-*` gradients, and any inline green glow/text-shadow RGBA values used inside `frontend/src/components/X39MatrixLaunchHeroBlock.tsx`.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "La parte que sale verde la puedes cambiar por el color azul celestial."
        ]
      },
      "acceptanceCriteria": [
        "In `frontend/src/components/X39MatrixLaunchHeroBlock.tsx`, no visible UI element in the launch hero uses green as the accent color; the corresponding accent color is a sky-blue/celestial-blue tone instead.",
        "Red accents (e.g., `red-500` treatments) remain present and visually consistent with the existing design.",
        "Glow/shadow effects previously using green RGBA values are updated to matching sky-blue/celestial-blue RGBA values (no green glow remains).",
        "The CTA gradient start color is updated from green to sky blue, while still blending into red on the other side (no green gradient stop remains).",
        "The supporting cards that currently use green borders/icons/headings are updated to sky-blue equivalents, keeping the middle red card unchanged."
      ]
    },
    {
      "id": "REQ-17",
      "text": "Update the launch ambient effects code-rain so that any green particle color is replaced with a celestial sky blue color, keeping the red particles unchanged, in `frontend/src/components/X39MatrixLaunchAmbientEffects.tsx`.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "La parte que sale verde la puedes cambiar por el color azul celestial."
        ]
      },
      "acceptanceCriteria": [
        "`frontend/src/components/X39MatrixLaunchAmbientEffects.tsx` no longer renders any green (e.g., `rgba(0, 255, 0, ...)`) particles; it renders sky-blue/celestial-blue particles instead.",
        "Red particles remain red.",
        "Reduced-motion behavior remains unchanged (effects stay disabled when `prefers-reduced-motion: reduce` is set)."
      ]
    }
  ],
  "constraints": [
    "Use English for any user-facing text.",
    "Do not edit any files under the immutable frontend paths listed in SYSTEM_CONTEXT.",
    "Keep the existing launch hero copy and layout behavior unchanged; only adjust the accent color styling from green to celestial sky blue."
  ],
  "nonGoals": [
    "Do not change the configured launch date, countdown logic, or post-launch messaging behavior.",
    "Do not introduce new sections, new CTAs, or new navigation behavior.",
    "Do not generate or modify image assets as part of this color change request."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}