{
  "kind": "build_request",
  "title": "Make the header triangle code-rain effect more aggressive and elegant",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-32",
      "text": "Update the top navigation header’s red triangle code-rain effect to feel more aggressive while also more elegant: increase perceived intensity (density/speed/variation) but keep a refined, readable look that never obscures the brand logo/text or menu items.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Más agresivo y elegante"
        ]
      },
      "acceptanceCriteria": [
        "In the header area only, the triangle rain reads as noticeably more intense than the current implementation (higher density and/or faster motion with more variation), while still looking clean (not muddy/overfilled).",
        "The brand area (logo + “x39Matrix” + subtext) and all nav items remain fully readable at all times; the effect must not visually overpower or cover them.",
        "The effect remains confined to the header region (does not bleed into main content)."
      ]
    },
    {
      "id": "REQ-33",
      "text": "Refine `frontend/src/components/header/HeaderTriangleCodeRain.tsx` to implement an “aggressive + elegant” neon-red (#FF0000) triangle-rain style: use a pure-black aesthetic, stronger edge-defined triangles (stroke-forward), and more dynamic motion (irregular fall speeds and subtle rotation/jitter) while keeping the animation performance-safe and stable.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Más agresivo y elegante"
        ]
      },
      "acceptanceCriteria": [
        "Triangles appear primarily as sharp, edge-defined glyphs (stroke-forward), with controlled glow so the shapes stay crisp rather than becoming large blurry blobs.",
        "Motion has visible variation (not uniform): at least two distinct movement behaviors are observable (e.g., different speed bands and/or slight drift/jitter/rotation variance).",
        "No runtime errors; no NaN/Infinity issues; no canvas rendering artifacts after resize.",
        "`prefers-reduced-motion: reduce` results in a static (or significantly reduced) rendering without continuous animation, consistent with the current accessibility behavior.",
        "No memory leaks: the animation loop and any observers are cleaned up correctly on unmount and do not multiply on re-render."
      ]
    },
    {
      "id": "REQ-34",
      "text": "Make the header background treatment more elegant and more aggressive by switching the header’s base to a true deep black (no visible gradient banding), with subtle texture/lines that support (not compete with) the triangle rain, keeping existing safe-area behavior and layout intact.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Más agresivo y elegante"
        ]
      },
      "acceptanceCriteria": [
        "The header background reads as deep black at a glance (no obvious multi-stop gradient), with only subtle texture accents.",
        "Header safe-area padding (`safe-top`) and fixed positioning remain correct across mobile/desktop viewports.",
        "No regressions to header layout: logo and text are not clipped/cropped on any viewport size."
      ]
    }
  ],
  "constraints": [
    "Do not edit any files under `frontend/src/components/ui` (shadcn/ui components are read-only).",
    "Do not edit immutable hook/bootstrap files: `frontend/src/hooks/useInternetIdentity.ts(x)`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`.",
    "Keep the effect accessibility-friendly and performance-safe; respect `prefers-reduced-motion`.",
    "Keep all user-facing text in English (if any text is touched as part of these changes)."
  ],
  "nonGoals": [
    "Do not add new site sections or change navigation structure.",
    "Do not introduce any backend changes for this request.",
    "Do not add third-party animation libraries; keep the implementation within the existing React/Canvas approach."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}