{
  "kind": "build_request",
  "title": "Prepare official Google Play and Apple App Store submission builds",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-7",
      "text": "Prepare an Android release submission build for Google Play, including generating a Play-ready Android App Bundle (AAB), ensuring the app’s package identifiers and versioning are set for release, and providing the final build artifact path(s) and release notes (English).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3",
          "msg-4"
        ],
        "quotes": [
          "Would you like me to prepare the official Play Store and App Store submission builds next?",
          "Si"
        ]
      },
      "acceptanceCriteria": [
        "A Play Store submission artifact (AAB) is produced via the project’s build tooling with a reproducible command.",
        "Release versioning (version name + version code) is incremented and documented for the submission build.",
        "A short English release notes text is included in the repo (or build output) and references the submission build version.",
        "The build output includes clear instructions for where to find the AAB and how to upload it to Google Play Console."
      ]
    },
    {
      "id": "REQ-8",
      "text": "Prepare an iOS release submission build for the Apple App Store, including producing a release archive suitable for App Store Connect submission and providing step-by-step signing/provisioning instructions required for a developer to export an IPA (English).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3",
          "msg-4"
        ],
        "quotes": [
          "Would you like me to prepare the official Play Store and App Store submission builds next?",
          "Si"
        ]
      },
      "acceptanceCriteria": [
        "A reproducible iOS release build process is documented (commands + required local prerequisites).",
        "The output includes clear instructions for provisioning profiles, signing certificates, and exporting an IPA for App Store Connect.",
        "A short English release notes text is included in the repo (or build output) and references the submission build version."
      ]
    },
    {
      "id": "REQ-9",
      "text": "Add an App Store / Play Store submission asset pack to the repository that includes required icons and store listing visuals at standard sizes, and ensure the web app’s branding is consistent with these assets (English naming and documentation).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3",
          "msg-4"
        ],
        "quotes": [
          "Would you like me to prepare the official Play Store and App Store submission builds next?",
          "Si"
        ]
      },
      "acceptanceCriteria": [
        "A dedicated folder exists under frontend/public/assets/generated containing the generated store assets with the exact filenames listed in imageRequirements.required.",
        "The asset pack includes at minimum: app icon(s), feature graphic / promotional graphic, and at least 3 screenshots.",
        "A short English README is added describing which files map to Google Play Console and App Store Connect upload slots."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/immutablePaths (including frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, and frontend/src/main.tsx). Compose around them instead.",
    "Respect the existing single-canister backend architecture; no new backend services."
  ],
  "nonGoals": [
    "Do not perform the actual submission in Google Play Console or App Store Connect (only produce submission-ready builds and instructions).",
    "Do not add third-party authentication providers (only Internet Identity is supported).",
    "Do not implement new token purchase/claim/staking features as part of this request."
  ],
  "imageRequirements": {
    "required": [
      "App icon, triangle-with-eye mark on dark background (app-icon.dim_1024x1024.png)",
      "Android adaptive icon foreground, triangle-with-eye mark only with transparent background (android-adaptive-foreground.dim_1024x1024.png)",
      "Android adaptive icon background, subtle dark tech pattern (android-adaptive-background.dim_1024x1024.png)",
      "Google Play feature graphic, dark cyber/tech banner with triangle-with-eye mark and minimal title text styling (play-feature-graphic.dim_1024x500.png)",
      "App Store screenshot 1, dark cyberpunk UI mock screenshot frame with title area and device frame (appstore-screenshot-1.dim_1290x2796.png)",
      "App Store screenshot 2, dark cyberpunk UI mock screenshot frame with title area and device frame (appstore-screenshot-2.dim_1290x2796.png)",
      "App Store screenshot 3, dark cyberpunk UI mock screenshot frame with title area and device frame (appstore-screenshot-3.dim_1290x2796.png)"
    ],
    "edits": []
  }
}