{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Aggressive + elegant header triangle code-rain and deep-black header treatment",
  "requirements": [
    {
      "id": "REQ-32",
      "summary": "Increase the header-only triangle code-rain intensity while keeping brand/logo and nav text fully readable and the effect confined to the header.",
      "acceptanceCriteria": [
        "In the header area only, the triangle rain reads as noticeably more intense than the current implementation (higher density and/or faster motion with more variation), while still looking clean (not muddy/overfilled).",
        "The brand area (logo + “x39Matrix” + subtext) and all nav items remain fully readable at all times; the effect must not visually overpower or cover them.",
        "The effect remains confined to the header region (does not bleed into main content)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/header/HeaderTriangleCodeRain.tsx",
          "operation": "modify",
          "description": "Tune rain intensity (density/speed/variation) with a strict performance-safe cap; ensure canvas drawing remains visually behind header content (no occlusion), and keep rendering clipped to the header bounds via the parent container sizing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Ensure header layering keeps brand/logo and nav items above the canvas effect at all times (z-index/isolation tweaks if needed) while keeping the effect confined to the fixed header region and not affecting main content."
        }
      ]
    },
    {
      "id": "REQ-33",
      "summary": "Refine HeaderTriangleCodeRain.tsx to a stroke-forward neon-red (#FF0000) triangle-rain on pure black with dynamic, varied motion while remaining performance-safe, stable, and reduced-motion friendly.",
      "acceptanceCriteria": [
        "Triangles appear primarily as sharp, edge-defined glyphs (stroke-forward), with controlled glow so the shapes stay crisp rather than becoming large blurry blobs.",
        "Motion has visible variation (not uniform): at least two distinct movement behaviors are observable (e.g., different speed bands and/or slight drift/jitter/rotation variance).",
        "No runtime errors; no NaN/Infinity issues; no canvas rendering artifacts after resize.",
        "`prefers-reduced-motion: reduce` results in a static (or significantly reduced) rendering without continuous animation, consistent with the current accessibility behavior.",
        "No memory leaks: the animation loop and any observers are cleaned up correctly on unmount and do not multiply on re-render."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/header/HeaderTriangleCodeRain.tsx",
          "operation": "modify",
          "description": "Implement an “aggressive + elegant” stroke-forward triangle renderer: reduce fill dominance, tighten glow, and add controlled variation (e.g., speed bands + subtle drift/jitter/rotation variance). Harden canvas math to avoid NaN/Infinity and fix resize stability (reset transforms before DPR scaling to prevent compounding). Keep RAF/ResizeObserver cleanup robust and respect prefers-reduced-motion by rendering a static/reduced frame without continuous animation."
        }
      ]
    },
    {
      "id": "REQ-34",
      "summary": "Switch the header base to true deep black (no visible gradient banding) with subtle supporting texture/lines, preserving safe-area and layout integrity.",
      "acceptanceCriteria": [
        "The header background reads as deep black at a glance (no obvious multi-stop gradient), with only subtle texture accents.",
        "Header safe-area padding (`safe-top`) and fixed positioning remain correct across mobile/desktop viewports.",
        "No regressions to header layout: logo and text are not clipped/cropped on any viewport size."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Refine `.header-matrix-black` to use a true deep-black base (avoid multi-stop gradients that can band) and adjust the ::before texture/line accents to remain subtle and supportive of the triangle rain (not competing). Preserve existing safe-area utilities and header layout behavior."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "If needed to support the new deep-black header treatment without layout regressions, adjust only header-related class usage (e.g., keeping `safe-top`, fixed positioning, and overflow clipping intact) while preserving the existing navigation structure."
        }
      ]
    }
  ]
}