{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "X39 launch hero: subtle falling X39 rain behind horse + red glowing eyes asset",
  "requirements": [
    {
      "id": "REQ-23",
      "summary": "Add a subtle falling “X39” rain effect behind the horse visual within the launch hero, styled like IntroScreen but lighter and motion-accessible.",
      "acceptanceCriteria": [
        "In the right-side hero visual area (horse column) there is a visible but subtle falling “X39” (or “X” + “39”) rain effect behind the horse image.",
        "The effect is visually similar in style to the intro text-rain (IntroScreen) but tuned to be lighter/less distracting than the intro.",
        "The effect respects prefers-reduced-motion (disabled or rendered as a static non-animated fallback when reduced motion is enabled).",
        "The effect does not block pointer events and does not interfere with layout on mobile or desktop.",
        "No NaN/Infinity/render-loop issues occur; animation is cleaned up on unmount (no leaked timers/raf)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/X39HorseX39RainBackdrop.tsx",
          "operation": "create",
          "description": "Create a scoped (non-fullscreen) canvas-based “X” + “39” falling-rain backdrop component for the horse visual area, inspired by IntroScreen’s styling but with reduced opacity/density/speed; ensure pointer-events are disabled, rendering is clipped to its container, prefers-reduced-motion uses a static single-frame fallback, and requestAnimationFrame/ResizeObserver/listeners are cleaned up on unmount."
        },
        {
          "path": "frontend/src/components/X39MatrixLaunchHeroBlock.tsx",
          "operation": "modify",
          "description": "Wire the new X39HorseX39RainBackdrop into the right-side hero horse visual container as an absolutely positioned layer behind the horse image (and behind/compatible with existing glow), ensuring it doesn’t affect layout, remains subtle for copy readability, and stays non-interactive (no pointer events)."
        }
      ]
    },
    {
      "id": "REQ-24",
      "summary": "Update the launch hero horse image to a new static asset version with clearly visible glowing red eyes.",
      "acceptanceCriteria": [
        "The horse graphic used by X39MatrixLaunchHeroBlock shows distinctly visible red glowing eyes at typical viewport sizes (mobile and desktop).",
        "Red eyes remain visible over the existing glow/drop-shadow treatments and do not appear washed out by filters.",
        "The updated image is served as a static asset from frontend/public/assets/generated and referenced directly by the frontend (no backend image serving)."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/x39-code-horse-red-eyes.dim_1400x1400.png",
          "operation": "create",
          "description": "Add the updated generated horse artwork with clearly visible glowing red eyes at frontend/public/assets/generated/x39-code-horse-red-eyes.dim_1400x1400.png (static asset; no backend serving)."
        },
        {
          "path": "frontend/src/components/X39MatrixLaunchHeroBlock.tsx",
          "operation": "modify",
          "description": "Update the horse <img> to reference the new static asset at frontend/public/assets/generated/x39-code-horse-red-eyes.dim_1400x1400.png, verifying existing drop-shadow/glow styling keeps the red eyes distinct on mobile and desktop."
        }
      ]
    }
  ]
}