{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Stabilize math-driven UI, restore launch hero assets, and unify sky-blue accent palette",
  "requirements": [
    {
      "id": "REQ-18",
      "summary": "Replace remaining green-themed brand accents with a consistent celestial sky-blue accent across the UI while keeping red accents unchanged.",
      "acceptanceCriteria": [
        "A search through the frontend codebase shows no remaining brand/decoration Tailwind green accent usage (e.g., text-green-*, border-green-*, from-green-*, via-green-*, to-green-*, shadow/rgba green glows) in the launch/hero/theme UI; where a green is used for semantic status, it is either replaced with sky-blue or explicitly justified as semantic and visually aligned with the new palette.",
        "Global CSS utilities that currently create green neon/glow effects (e.g., .neon-text-green) are updated to a sky-blue equivalent and all consumers are updated accordingly.",
        "Components that currently render green gradients for positive indicators (e.g., progress bars) are updated to use sky-blue so the app has a single consistent accent color family (sky-blue + red)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Update global theme variables and glow utilities to align with the celestial sky-blue accent (while preserving red accents), including replacing the green neon/glow utility with a sky-blue equivalent and updating any related rgba green glow definitions."
        },
        {
          "path": "frontend/src/components/LiveICPPrice.tsx",
          "operation": "modify",
          "description": "Replace positive-state green gradient/progress styling (including any green glow/box-shadow usage) with sky-blue equivalents while keeping negative-state red styling unchanged."
        },
        {
          "path": "frontend/src/components/GraficosSection.tsx",
          "operation": "modify",
          "description": "Replace green accent usage used for bullish/positive visuals (bars, RSI low/positive styling, buy signals) with sky-blue equivalents, ensuring the overall chart module uses only the sky-blue + red accent families."
        },
        {
          "path": "frontend/src/components/TokenAnalyticsPanel.tsx",
          "operation": "modify",
          "description": "Replace remaining green accent usage (icons/highlights for positive metrics) with sky-blue accents while preserving red accents and maintaining legible contrast."
        }
      ]
    },
    {
      "id": "REQ-19",
      "summary": "Fix calculation and rendering edge cases so countdown, charts, projections, and derived metrics never produce NaN/Infinity or unstable UI states.",
      "acceptanceCriteria": [
        "Launch countdown never shows negative values and reliably switches to a clear post-launch state (e.g., “NOW LIVE”) when the launch time is reached.",
        "Charting UI never renders NaN/Infinity-based styles (e.g., bar heights) even when the price range is 0 or when there is insufficient data; it must display a safe fallback UI state instead of breaking layout.",
        "RSI and signal generation never crashes due to missing/short datasets; when not enough candles exist, RSI is shown as a safe neutral value and signals list behaves predictably.",
        "All derived strings (projection text, error messages, labels) are stable (no undefined, no broken formatting) under slow networks and API failures."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useLaunchCountdown.ts",
          "operation": "modify",
          "description": "Harden countdown calculations to clamp all displayed time units to safe non-negative integers and ensure the launched state is triggered reliably at/after launch time without any negative display flicker."
        },
        {
          "path": "frontend/src/components/GraficosSection.tsx",
          "operation": "modify",
          "description": "Add guards for insufficient/empty datasets and zero price ranges so bar heights, RSI polyline points, projections, and signals never compute NaN/Infinity; render a safe fallback UI when data is missing/invalid instead of producing broken layout."
        },
        {
          "path": "frontend/src/services/icpMarketData.ts",
          "operation": "modify",
          "description": "Normalize and validate parsed market numbers (price/klines) to ensure non-finite values are rejected/handled, and ensure error paths consistently produce stable failures the UI can display safely under network/API issues."
        }
      ]
    },
    {
      "id": "REQ-20",
      "summary": "Fix missing/static-asset regressions so the launch hero background texture and code-horse image load reliably from frontend static assets.",
      "acceptanceCriteria": [
        "The launch hero background texture image loads successfully (no 404) and displays with the intended opacity over the black background.",
        "The code-horse image loads successfully (no 404) and displays with the intended glow/drop-shadow effects.",
        "No runtime console errors related to missing `/assets/generated/*` launch images during normal navigation and hard refresh."
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/x39-launch-bg.dim_1920x1080.png",
          "operation": "create",
          "description": "Add the required generated launch background texture asset at the exact static path so it is available via frontend public assets."
        },
        {
          "path": "frontend/public/assets/generated/x39-code-horse.dim_1400x1400.png",
          "operation": "create",
          "description": "Add the required generated code-horse hero asset at the exact static path so it is available via frontend public assets."
        },
        {
          "path": "frontend/src/components/X39MatrixLaunchHeroBlock.tsx",
          "operation": "modify",
          "description": "Verify the hero references the generated static assets only (background + code-horse) and adjust any path/attribute usage to prevent production 404s on navigation and hard refresh while preserving the intended opacity and glow effects."
        }
      ]
    },
    {
      "id": "REQ-21",
      "summary": "Ensure all user-facing strings changed by these fixes are English and align with the existing translation approach, without touching immutable paths.",
      "acceptanceCriteria": [
        "Any newly introduced/modified UI text as part of these fixes is English-first and does not introduce new Spanish-only hardcoded strings.",
        "No changes are made to immutable frontend paths listed in SYSTEM_CONTEXT.",
        "Existing translation keys continue to work and the app builds successfully."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/LanguageContext.tsx",
          "operation": "modify",
          "description": "Add/adjust translation keys needed for any updated UI messaging introduced by the fixes (English-first), keeping existing keys working and avoiding changes to any immutable paths."
        },
        {
          "path": "frontend/src/components/GraficosSection.tsx",
          "operation": "modify",
          "description": "Replace any modified/introduced user-facing strings with English copy and/or LanguageContext translation keys; ensure errors, labels, and projection text remain stable and English under loading/failure states."
        },
        {
          "path": "frontend/src/components/TokenAnalyticsPanel.tsx",
          "operation": "modify",
          "description": "Update any user-facing strings touched by palette/stability changes to English-first and/or LanguageContext keys while preserving current layout and avoiding immutable path changes."
        }
      ]
    },
    {
      "id": "REQ-22",
      "summary": "Run an end-to-end regression pass and fix remaining runtime, navigation/scroll, and responsive layout issues introduced or uncovered by the above changes.",
      "acceptanceCriteria": [
        "No uncaught exceptions in the browser console during a standard run-through: load homepage, interact with launch hero CTA (smooth scroll), open/close chart panel, and view key sections.",
        "Mobile and desktop layouts remain responsive with no overlapping text, clipped CTAs, or unreadable contrast introduced by the palette changes.",
        "`npm` build/lint completes successfully (no TypeScript errors introduced by the fixes)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Harden section navigation and CTA scroll behavior to avoid broken scroll targets and to respect prefers-reduced-motion (use non-animated scrolling when reduced motion is enabled) while preserving existing navigation structure."
        },
        {
          "path": "frontend/src/components/X39MatrixLaunchHeroBlock.tsx",
          "operation": "modify",
          "description": "Update the launch hero CTA scroll behavior to respect prefers-reduced-motion and ensure scroll targets remain reliable across mobile/desktop without introducing layout regressions."
        },
        {
          "path": "frontend/src/components/GraficosSection.tsx",
          "operation": "modify",
          "description": "Ensure the chart panel open/close flow is robust (no runtime errors on rapid toggles, interval switches, slow networks, or missing data) and that responsive layouts remain readable after palette and calculation hardening."
        }
      ]
    }
  ]
}