{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Replace X39 Matrix launch green accents with celestial sky blue",
  "requirements": [
    {
      "id": "REQ-16",
      "summary": "Update X39 Matrix launch hero styling to replace all green accents with celestial sky blue while keeping red accents and layout/copy unchanged.",
      "acceptanceCriteria": [
        "In `frontend/src/components/X39MatrixLaunchHeroBlock.tsx`, no visible UI element in the launch hero uses green as the accent color; the corresponding accent color is a sky-blue/celestial-blue tone instead.",
        "Red accents (e.g., `red-500` treatments) remain present and visually consistent with the existing design.",
        "Glow/shadow effects previously using green RGBA values are updated to matching sky-blue/celestial-blue RGBA values (no green glow remains).",
        "The CTA gradient start color is updated from green to sky blue, while still blending into red on the other side (no green gradient stop remains).",
        "The supporting cards that currently use green borders/icons/headings are updated to sky-blue equivalents, keeping the middle red card unchanged."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/X39MatrixLaunchHeroBlock.tsx",
          "operation": "modify",
          "description": "Replace all green Tailwind accent classes (e.g., `text-green-*`, `border-green-*`, `via-green-*`, `from-green-*`, `hover:*green-*`) with celestial/sky-blue equivalents (e.g., `sky-*`), while keeping all existing red accents unchanged. Update any inline green glow/text-shadow/drop-shadow RGBA values (e.g., `rgba(34, 197, 94, ...)`) to matching celestial/sky-blue RGBA values; ensure the CTA gradient starts with sky-blue and still blends into red, and update supporting cards 1 & 3 accents to sky-blue while leaving the middle red card unchanged."
        }
      ]
    },
    {
      "id": "REQ-17",
      "summary": "Update Matrix code-rain ambient effects to use celestial sky blue instead of green for non-red particles, preserving reduced-motion behavior.",
      "acceptanceCriteria": [
        "`frontend/src/components/X39MatrixLaunchAmbientEffects.tsx` no longer renders any green (e.g., `rgba(0, 255, 0, ...)`) particles; it renders sky-blue/celestial-blue particles instead.",
        "Red particles remain red.",
        "Reduced-motion behavior remains unchanged (effects stay disabled when `prefers-reduced-motion: reduce` is set)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/X39MatrixLaunchAmbientEffects.tsx",
          "operation": "modify",
          "description": "Change the particle color selection logic so the green particle color (e.g., `rgba(0, 255, 0, ...)`) is replaced with a celestial/sky-blue RGBA value, while leaving the red particle RGBA unchanged; do not alter reduced-motion checks or the effect disable behavior."
        }
      ]
    }
  ]
}