{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Connectivity & Domain Diagnostics view for x39matrix.com (frontend)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add a user-accessible Connectivity & Domain Diagnostics view with clear access mechanism, core environment details, and readable automated check results.",
      "acceptanceCriteria": [
        "A diagnostics view can be opened via a clearly documented mechanism (e.g., a footer link labeled \"Diagnostics\" or a URL parameter).",
        "The view displays: current origin (window.location.origin), whether the page is in HTTPS, the configured OFFICIAL_PORTAL_URL (https://x39matrix.com), and the current timestamp (client-side).",
        "The view runs a small set of automated checks and shows pass/fail per check with readable error messages in English (no raw stack traces)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ConnectivityDiagnostics.tsx",
          "operation": "create",
          "description": "Create the \"Connectivity & Domain Diagnostics\" view component that renders environment info (origin, HTTPS yes/no, OFFICIAL_PORTAL_URL, client timestamp) and a check-results table/list with English pass/fail states and user-friendly error messages (no raw stack traces)."
        },
        {
          "path": "frontend/src/hooks/useConnectivityDiagnostics.ts",
          "operation": "create",
          "description": "Add a hook that orchestrates running diagnostics checks on demand (and/or on open), normalizes errors into readable English messages, and returns structured check state (pending/pass/fail) for the Diagnostics view."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire the Diagnostics view into the app so it is user-accessible: add a clearly labeled footer link (\"Diagnostics\") that opens the diagnostics UI and also support a URL-parameter-based entry (e.g., diagnostics=1) using existing URL param utilities."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Implement client-side diagnostics checks for canonical domain consistency, static asset reachability from https://x39matrix.com, and a copy-to-clipboard compact report.",
      "acceptanceCriteria": [
        "The diagnostics checks include: (1) canonical domain consistency check (detect if the app is not being served from x39matrix.com), and (2) a reachability test that attempts to load at least one known static asset from https://x39matrix.com (e.g., the favicon or a generated logo image) and reports success/failure.",
        "If the browser blocks cross-origin fetches, the reachability test uses a browser-safe method (e.g., image load) and still reports a definitive success/failure state.",
        "The diagnostics output includes a copy-to-clipboard button that copies a compact report string (origin, HTTPS yes/no, results of checks) so users can share it."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useConnectivityDiagnostics.ts",
          "operation": "modify",
          "description": "Implement automated checks: (1) canonical domain consistency against OFFICIAL_PORTAL_URL, and (2) static asset reachability by attempting a browser-safe cross-origin image load from https://x39matrix.com (use a known existing asset path such as /assets/generated/x39matrix-favicon.dim_32x32.png) and producing definitive success/failure plus readable error text."
        },
        {
          "path": "frontend/src/components/ConnectivityDiagnostics.tsx",
          "operation": "modify",
          "description": "Add a copy-to-clipboard control that copies a compact report string including current origin, HTTPS yes/no, and per-check pass/fail outcomes; show a small English success/failure status for the copy action."
        },
        {
          "path": "frontend/src/utils/urls.ts",
          "operation": "modify",
          "description": "Add a small helper for domain diagnostics as needed (e.g., extracting the expected hostname from OFFICIAL_PORTAL_URL and/or building a canonical-asset URL) to keep the Diagnostics logic consistent and centralized."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Surface lightweight backend health info (time/version/identifier) inside the frontend Diagnostics view and show a clear unreachable error if it cannot be reached.",
      "acceptanceCriteria": [
        "Backend exposes a query method (no auth required) that returns: server/canister timestamp, canister principal (or a stable identifier), and an app version string.",
        "Frontend Diagnostics view calls this endpoint and displays the returned values or a clear error message if unreachable.",
        "The UI labels are in English (e.g., \"Backend reachable\", \"Backend time\", \"Version\")."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useConnectivityDiagnostics.ts",
          "operation": "modify",
          "description": "Integrate backend health retrieval into the diagnostics run using the existing backend actor capability (backendInterface.checkBackendHealth) and map failures to a clear, English \"Backend unreachable\"-style error state."
        },
        {
          "path": "frontend/src/components/ConnectivityDiagnostics.tsx",
          "operation": "modify",
          "description": "Display backend health section with English labels (e.g., \"Backend reachable\", \"Backend time\", \"Version\") using the health data returned by the backend call, and show a clear English error message when the call fails."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Ensure Diagnostics view wiring triggers/permits backend health loading when the view is opened (via footer link or URL parameter) and that unreachable states are visible to the user within the same Diagnostics UI."
        }
      ]
    }
  ]
}